src/Catalogs/КомандыАвтоматизации/КомандыАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомандыАвтоматизации</name>
  <attributes>
    <name>Поставляется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОбязательные</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеПараметраВАгенте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияПараметра</name>
      <type>
        <types>EnumRef.СпособыЗаполненияПараметровКоманды</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтносительнаяСсылкаНаРеквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыДополнительные</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеПараметраВАгенте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияПараметра</name>
      <type>
        <types>EnumRef.СпособыЗаполненияПараметровКоманды</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтносительнаяСсылкаНаРеквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МетаданныеСвязанныхОбъектов</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтурыАдминистрирования</name>
    <comment>Используется для ограничения доступа к данным. Если не выбрано, доступно всем</comment>
    <attributes>
      <name>Контур</name>
      <type>
        <types>CatalogRef.КонтурыАдминистрирования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/СпособыЗаполненияПараметровКоманды/СпособыЗаполненияПараметровКоманды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗаполненияПараметровКоманды</name>
  <enumValues>
    <name>РучнойВвод</name>
  </enumValues>
  <enumValues>
    <name>ИзОбъектаМетаданных</name>
  </enumValues>
  <enumValues>
    <name>ИзКонфиденциальногоХранилища</name>
  </enumValues>
  <enumValues>
    <name>ПустаяСтрока</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КомандыАвтоматизации/Forms/ФормаЭлемента/Module.bsl
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		Элементы.МетаданныеСвязанныхОбъектовИмяОбъекта.СписокВыбора.Добавить(ОбъектМетаданных.ПолноеИмя());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОтносительнаяСсылкаНаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элемент.СписокВыбора.Очистить();
	Если Элемент.Родитель.Родитель.ТекущиеДанные.СпособЗаполненияПараметра = ПредопределенноеЗначение("Перечисление.СпособыЗаполненияПараметровКоманды.ИзОбъектаМетаданных") Тогда
		Данные = РаботаСоСценариямиАвтоматизацииСервер.ОбновитьСписокВыбораОтносительныхСсылок(Объект.МетаданныеСвязанныхОбъектов);
		Элемент.СписокВыбора.ЗагрузитьЗначения(Данные.ВыгрузитьЗначения());
	КонецЕсли;	
	Элемент.СписокВыбора.Вставить(0, "Строка");
	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаПараметрыОбязательные Тогда
		ТекДанные = Элементы.ПараметрыОбязательные.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			НоваяСтрока = Объект.ПараметрыДополнительные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные);
			Объект.ПараметрыОбязательные.Удалить(ТекДанные);
		КонецЕсли;	
	Иначе
		ТекДанные = Элементы.ПараметрыДополнительные.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			НоваяСтрока = Объект.ПараметрыОбязательные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные);
			Объект.ПараметрыДополнительные.Удалить(ТекДанные);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
